---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementBoundaryLocation
source: html/349e4292-28b6-cffa-e128-50ac5c90db36.htm
---
# Autodesk.Revit.DB.SpatialElementBoundaryLocation

An enumerated type listing boundary options of spatial element geometry calculation.

## Syntax (C#)
```csharp
public enum SpatialElementBoundaryLocation
```